results/local/hey_stream_high.txt

Summary:
  Total:	185.0930 secs
  Slowest:	29.3827 secs
  Fastest:	0.0209 secs
  Average:	7.6634 secs
  Requests/sec:	55.4694
  

Response time histogram:
  0.021 [1]	|
  2.957 [490]	|■■■■
  5.893 [924]	|■■■■■■■
  8.829 [5579]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  11.766 [2010]	|■■■■■■■■■■■■■■
  14.702 [13]	|
  17.638 [37]	|
  20.574 [49]	|
  23.510 [0]	|
  26.447 [39]	|
  29.383 [28]	|


Latency distribution:
  10% in 4.6939 secs
  25% in 6.7231 secs
  50% in 8.0166 secs
  75% in 8.7544 secs
  90% in 9.7954 secs
  95% in 10.1282 secs
  99% in 19.7405 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0037 secs, 0.0209 secs, 29.3827 secs
  DNS-lookup:	0.0022 secs, 0.0000 secs, 0.4323 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0221 secs
  resp wait:	7.6482 secs, 0.0120 secs, 29.3659 secs
  resp read:	0.0105 secs, 0.0000 secs, 1.0482 secs

Status code distribution:
  [200]	9170 responses

Error distribution:
  [691]	Get "http://localhost/stream/20": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
  [1]	Get "http://localhost/stream/20": dial tcp [::1]:80: connect: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp 127.0.0.1:55270->127.0.0.1:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp 127.0.0.1:55391->127.0.0.1:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54728->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54729->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54730->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54731->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54732->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54733->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54734->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54735->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54736->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54737->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54738->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54739->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54740->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54741->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54742->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54743->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54744->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54745->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54746->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54747->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54748->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54749->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54750->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54751->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54752->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54753->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54754->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54755->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54756->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54757->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54758->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54759->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54760->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54761->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54762->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54763->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54764->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54765->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54766->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54767->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54768->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54769->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54770->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54771->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54772->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54773->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54774->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54775->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54776->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54777->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54778->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54779->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54780->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54781->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54782->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54783->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54784->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54785->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54786->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54787->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54788->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54789->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54790->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54791->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54792->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54793->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54794->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54795->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54796->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54797->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54798->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54799->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54800->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54801->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54802->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54803->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54804->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54805->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54806->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54807->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54808->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54809->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54810->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54811->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54812->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54813->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54814->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54815->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54816->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54817->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54818->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54819->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54820->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54821->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54822->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54823->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54824->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54825->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54826->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54827->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54828->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54829->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54830->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54831->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54832->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54833->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54834->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54835->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54836->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54837->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54838->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54839->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54840->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54841->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54842->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54843->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54844->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54845->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54846->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54847->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54848->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54849->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54850->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54851->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54852->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54853->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54854->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54855->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54856->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54858->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54860->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54861->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54862->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54864->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54865->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54866->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54868->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54869->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54870->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54872->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54873->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54874->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54876->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54877->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54878->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54879->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54880->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54881->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54883->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54884->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54885->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54888->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54890->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54891->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54892->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54893->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54896->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54897->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54898->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54899->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54901->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54902->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54903->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54904->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54905->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54906->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54907->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54908->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54909->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54911->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54912->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54913->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54915->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54916->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54917->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54918->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54919->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54920->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54921->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54923->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54924->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54925->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54926->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54927->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54928->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54930->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54932->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54933->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54934->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54935->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54936->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54937->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54939->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54941->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54942->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54943->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54944->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54945->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54946->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54949->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54950->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54952->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54953->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54955->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54956->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54957->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54958->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54959->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54961->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54963->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54964->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54965->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54966->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54967->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54968->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54969->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54970->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54971->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54972->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54973->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54974->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54975->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54976->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54977->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54979->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54980->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54981->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54982->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54983->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54984->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54985->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54986->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54987->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54988->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54989->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54990->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54991->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54992->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54993->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54995->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54996->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54997->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54998->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:54999->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55000->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55002->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55003->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55004->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55005->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55006->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55007->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55009->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55010->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55011->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55012->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55013->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55014->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55015->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55016->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55017->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55018->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55020->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55021->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55022->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55023->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55108->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55109->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55110->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55111->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55113->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55114->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55116->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55117->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55118->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55121->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55137->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55138->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55139->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55145->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55157->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55159->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55162->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55163->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55164->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55165->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55169->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55171->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55195->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55272->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55273->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55274->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55275->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55276->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55279->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55281->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55282->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55285->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55287->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55288->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55289->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55291->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55292->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55294->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55295->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55297->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55299->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55300->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55301->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55302->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55303->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55304->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55305->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55306->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55308->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55309->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55310->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55312->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55314->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55315->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55316->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55318->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55319->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55320->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55322->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55324->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55325->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55327->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55329->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55330->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55331->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55333->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55334->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55335->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55337->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55338->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55339->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55340->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55342->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55343->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55344->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55345->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55347->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55349->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55353->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55354->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55355->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55356->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55358->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55361->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55363->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55366->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55368->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55371->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55372->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55375->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55377->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55380->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55381->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55383->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55384->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55386->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55388->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55389->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55392->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55393->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55395->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55396->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55397->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55399->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55400->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55401->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55404->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55407->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55408->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55409->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55411->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55412->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55413->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55415->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55417->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55419->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55420->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55421->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55422->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55423->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55427->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55429->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55431->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55432->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55433->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55436->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55466->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55467->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55469->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55470->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55471->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55474->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55475->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": read tcp [::1]:55477->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": readLoopPeekFailLocked: read tcp [::1]:55135->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": readLoopPeekFailLocked: read tcp [::1]:55425->[::1]:80: read: connection reset by peer
  [1]	Get "http://localhost/stream/20": write tcp [::1]:55367->[::1]:80: write: broken pipe
  [1]	Get "http://localhost/stream/20": write tcp [::1]:55410->[::1]:80: write: broken pipe